channel_api_tests/ctrip/happy_paths/rates_update.xml

URL: http://58.221.127.196:8090/Hotel/OTAReceive/HotelRateAmountNotif.asmx

Request:

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <OTA_HotelRateAmountNotifRQ Version="2.2" PrimaryLangID="language" xmlns="http://www.opentravel.org/OTA/2003/05">
      <POS>
        <Source>
          <RequestorID ID="54394" Type="1" MessagePassword="qaz123">
            <CompanyName Code="C" CodeContext="4085" />
          </RequestorID>
        </Source>
      </POS>
      <RateAmountMessages HotelCode="54394">
        <RateAmountMessage>
          <StatusApplicationControl RatePlanCode="1251431" RatePlanCategory="16" />
          <Rates Start="2015-10-16" End="2015-10-16">
            <Rate>
              <BaseByGuestAmts>
                <BaseByGuestAmt Code="Sell" AmountAfterTax="500000" CurrencyCode="IDR">
              </BaseByGuestAmts>
              <MealsIncluded Breakfast="false" />
            </Rate>
          </Rates>
        </RateAmountMessage>
      </RateAmountMessages>
    </OTA_HotelRateAmountNotifRQ>
  </soap:Body>
</soap:Envelope>

Response: